# -------------------------------- SERVICE MESSAGES --------------------------------

on_startup = 'Бот запущен'
on_shutdown = 'Бот остановлен'

# -------------------------------- COMMANDS --------------------------------

start = (
    '<b>Приветствую!</b> 👋 \n'
    'Чтобы узнать <i>возможности</i> бота, введите команду /help. \n'
    'Если вы хотите быстрее перейти к <i>книгам</i> - воспользуйтесь командой /menu. \n'
    '<b>Приятного пользования!</b>'
)

help = (
    'Данный бот предназначен для упрощения поиска книг 🔎📚\n\n'
    'Он выполняет две основные функции: \n'
    '1) Ищет книгу по запросу в магазинах: <b>Ozon</b>, <b>Wildberries</b>, <b>Читай город</b>. \n'
    '2) Определяет название и автора книги по отрывку <i>(в разработке)</i>. \n\n'
    'Код проекта можно посмотреть здесь https://github.com/tcaty/book-helper-tg-bot \n\n'
    'Надеемся, этот бот сможет помочь вам! Удачи!\n'
    'Да не спалит нас Incapsula! 🤞 \n\n'
    'P.S. <i>Бот игнорирует обычные сообщения, для общения с ним используйте <b>команды</b>.</i> /menu'
)

menu = 'Пожалуйста, выберите нужный пункт меню'

# -------------------------------- MISC --------------------------------

select_count = 'Выберите количество товаров, которое будет отображаться для <b>каждого</b> магазина ❔'

select_sorting_reverse = 'Выберите, как будут сортироваться товары ❔'

search_settings_saved = 'Ваши настройки сохранены ✔️ Теперь вы можете воспользоваться поиском /menu.'

enter_author_and_title = 'Введите название книги и автора...'

desc = 'по убыванию ⬇️'
asc = 'по возрастанию ⬆️'

your_search_settings = (
    'Ваши настройки поиска: ⚙️\n'
    'Книг отображается: <b>%s</b> 📝\n'
    'Сортировка цен: <b>%s</b>'
)

book_not_found = 'К сожалению, такую книгу найти не удалось 😔'

separator = '📚'

error = 'Упс... Произошла какая-то ошибка 😬'

error_report = (
    '❌ Ошибка ❌ \n\n'
    'Сообщение: \n'
    '%s \n\n'
    'Исключение: \n'
    '%s'
)

in_development = 'Данная функция в разработке... 🕓'

# -------------------------------- STICKERS --------------------------------

cat_ghoul = 'CAACAgIAAxkBAAED_G5iFL_thXwmvW4sXXz_qemWU8wKqAACBAADrMF8KG30iA5Caip2IwQ'
